renesas/ra-fsp-examples/application_projects/r01an6815/bleapp_fwupdate_ryz012_ra4m2_baremetal/qe_gen/ble/profile_cmn/r_ble_servs_if.c
                                st_ble_gatt_value_t gatt_value;
                                R_BLE_GATTS_GetAttr(p_data->conn_hdl, p_write_rsp_evt_param->attr_hdl, &gatt_value);

                                ret = p_char->pp_descs[d]->decode(p_app_value, &gatt_value);

                                if (NULL != p_char->pp_descs[d]->write_comp_cb)
                                {
                                    p_char->pp_descs[d]->write_comp_cb(&p_char->pp_descs[d], p_data->conn_hdl, ret, p_app_value);
                                }
                                else
                                {
                                    st_ble_servs_evt_data_t evt_data = {
                                        .conn_hdl  = p_data->conn_hdl,
                                        .param_len = p_char->pp_descs[d]->app_size,
                                        .p_param   = p_app_value,
                                    };
                                    p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->pp_descs[d]->desc_idx, p_char->pp_descs[d]->inst_idx, BLE_SERVS_WRITE_COMP), BLE_SUCCESS, &evt_data);
                                }

                                free(p_app_value);
                                break;
                            }
                        }
                    }
                }
            }
        } break;

        case BLE_GATTS_EVENT_PREPARE_WRITE_RSP_COMP:
        {
             st_ble_gatts_prepare_write_rsp_evt_t *p_prepare_write_evt_param =
                (st_ble_gatts_prepare_write_rsp_evt_t *)p_data->p_param;

             s_write_long_attr_hdl = p_prepare_write_evt_param->attr_hdl;
        } break;

        case BLE_GATTS_EVENT_EXE_WRITE_RSP_COMP:
        {
            st_ble_gatts_exe_write_rsp_evt_t *p_exe_write_evt_param =
                (st_ble_gatts_exe_write_rsp_evt_t *)p_data->p_param;

            const st_ble_servs_info_t       *p_serv = NULL;
            const st_ble_servs_char_info_t  *p_char = NULL;

            find_attr(s_write_long_attr_hdl, &p_serv, &p_char);

            if ((NULL != p_serv) && (NULL != p_char))
            {
                if (BLE_GATTC_EXECUTE_WRITE_EXEC_FLAG == p_exe_write_evt_param->exe_flag) {
                    /* Characteristic */
                    if (((p_char->start_hdl + 1) == s_write_long_attr_hdl) && (NULL != p_char->decode))
                    {
                        ble_status_t ret;

                        void *p_app_value;
                        p_app_value = malloc(p_char->app_size);

                        ret = R_BLE_SERVS_GetChar(p_char, p_data->conn_hdl, p_app_value);

                        if (NULL != p_char->write_comp_cb)
                        {
                            p_char->write_comp_cb(p_char, p_data->conn_hdl, result, p_app_value);
                        }
                        else
                        {
                            st_ble_servs_evt_data_t evt_data = {
                                .conn_hdl = p_data->conn_hdl,
                                .param_len = p_char->app_size,
                                .p_param = p_app_value,
                            };
                            p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->char_idx, p_char->inst_idx, BLE_SERVS_WRITE_COMP), ret, &evt_data);
                        }

                        free(p_app_value);
                        s_write_long_attr_hdl = BLE_GATT_INVALID_ATTR_HDL_VAL;
                    }
                    /* Descriptor */
                    else
                    {
                        if (NULL != p_char->pp_descs)
                        {
                            for (uint8_t d = 0; d < p_char->num_of_descs; d++)
                            {
                                if ((p_char->pp_descs[d]->attr_hdl == s_write_long_attr_hdl) &&
                                    (NULL != p_char->pp_descs[d]->decode))
                                {
                                    ble_status_t ret;

                                    void *p_app_value;
                                    p_app_value = malloc(p_char->pp_descs[d]->app_size);

                                    st_ble_gatt_value_t gatt_value;
                                    R_BLE_GATTS_GetAttr(p_data->conn_hdl, s_write_long_attr_hdl, &gatt_value);

                                    ret = p_char->pp_descs[d]->decode(p_app_value, &gatt_value);

                                    if (NULL != p_char->pp_descs[d]->write_comp_cb)
                                    {
                                        p_char->pp_descs[d]->write_comp_cb(&p_char->pp_descs[d], p_data->conn_hdl, ret, p_app_value);
                                    }
                                    else
                                    {
                                        st_ble_servs_evt_data_t evt_data = {
                                            .conn_hdl = p_data->conn_hdl,
                                            .param_len = p_char->pp_descs[d]->app_size,
                                            .p_param = p_app_value,
                                        };
                                        p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->pp_descs[d]->desc_idx, p_char->pp_descs[d]->inst_idx, BLE_SERVS_WRITE_COMP), BLE_SUCCESS, &evt_data);
                                    }

                                    free(p_app_value);
                                    s_write_long_attr_hdl = BLE_GATT_INVALID_ATTR_HDL_VAL;
                                    break;
                                }
                            }
                        }
                    }
                }
            }
        } break;

        case BLE_GATTS_EVENT_READ_RSP_COMP:
        case BLE_GATTS_EVENT_READ_BY_TYPE_RSP_COMP:
        case BLE_GATTS_EVENT_READ_BLOB_RSP_COMP:
        case BLE_GATTS_EVENT_READ_MULTI_RSP_COMP:
        case BLE_GATTS_EVENT_INVALID:
        default:
        {
        } break;
    }
}

